app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."id" DESC
---
  def index
    @feeds = Post.all.reverse_order

INSERT INTO "posts" ("content", "firm_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Test"], ["firm_id", 1], ["user_id", 1], ["created_at", "2015-01-12 18:37:43.446212"], ["updated_at", "2015-01-12 18:37:43.446212"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save